# =============================================================================
# Brewfile - Homebrew Package Declaration
# =============================================================================
# Mantenha comentários de DESINSTALAR para referência futura.
# Formato: brew "pacote" | cask "pacote" | tap "org/tap"
# =============================================================================

# =============================================================================
# TAPS (fontes de pacotes adicionais)
# =============================================================================
tap "blacktop/tap"
tap "deskflow/tap"
tap "LizardByte/homebrew"

# =============================================================================
# ORPHAN PACKAGES (sem categoria definida - revisar)
# =============================================================================
brew "syncthing"
cask "hiddenbar"
cask "deskflow"
cask "daisydisk"

# =============================================================================
# SHELL & CORE
# =============================================================================
brew "zsh"
brew "bash"
brew "micro"
brew "vim"
brew "neovim"
brew "nano"
# DESINSTALAR: Editor pesado, 134MB, neovim cobre bem
# brew "emacs"
brew "ed"
cask "claude-code"
brew "lazygit"
brew "glow"

# =============================================================================
# SYSTEM UTILITIES (GNU replacements & core tools)
# =============================================================================
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gawk"
brew "make"
brew "cmake"
brew "binutils"
brew "wget"
brew "curl"
brew "rsync"
brew "openssh"
brew "tree"
brew "less"
brew "pv"
brew "xz"
brew "gzip"
brew "unzip"
brew "unar"
brew "readline"
brew "openssl@3"

# =============================================================================
# FILE MANAGEMENT & SEARCH
# =============================================================================
brew "yazi"
brew "ranger"
brew "broot"
brew "lf"
brew "fd"
brew "fzf"
brew "ack"
brew "ag"
brew "rg"
brew "ripgrep-all"

# =============================================================================
# MODERN REPLACEMENTS (better defaults)
# =============================================================================
brew "lsd"
brew "bat"
brew "eza"
brew "dust"
brew "duf"
brew "procs"
brew "sd"
brew "hyperfine"
brew "choose"
brew "fdupes"

# =============================================================================
# DIFF & COMPARISON
# =============================================================================
brew "diffutils"
brew "colordiff"
brew "diff-so-fancy"
brew "icdiff"
brew "wdiff"

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================
brew "git"
brew "gh"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "bfg"
brew "hub"
brew "pre-commit"
brew "shellcheck"
brew "yamllint"
brew "cloc"
brew "tokei"
brew "gource"
brew "ansible"
brew "ansible-lint"

# =============================================================================
# LANGUAGES & VERSION MANAGERS
# =============================================================================
brew "rust"
brew "go"
brew "python3"
# DESINSTALAR: Python extra, uv já gerencia versões
# brew "python@3.14"
brew "pipx"
brew "uv"
brew "pyenv"
brew "node"
brew "nvm"
brew "npm"
brew "yarn"
brew "ruby"
brew "rbenv"
brew "ruby-build"
# DESINSTALAR: PHP package manager, só se desenvolve PHP
# brew "composer"
# DESINSTALAR: Linter PHP, só se desenvolve PHP
# brew "php-cs-fixer"
# DESINSTALAR: Testes PHP, só se desenvolve PHP
# brew "phpunit"

# =============================================================================
# BUILD DEPENDENCIES
# =============================================================================
brew "autoconf"
brew "automake"
brew "gmp"
brew "libffi"
brew "libyaml"
brew "zlib"
brew "libevent"
brew "libpq"
brew "fontconfig"
brew "icu4c"

# =============================================================================
# DATABASES
# =============================================================================
brew "postgresql"
brew "mariadb"
brew "redis"

# =============================================================================
# NETWORK TOOLS
# =============================================================================
brew "doggo"
brew "dnsmasq"
brew "nmap"
brew "wireshark"
brew "wireguard-tools"
brew "openconnect"
brew "mtr"
brew "fping"
brew "prettyping"
brew "httpie"
brew "wrk"
brew "iperf3"
brew "aria2"
brew "speedtest-cli"
brew "bandwhich"
brew "ngrep"
brew "iftop"
brew "ipcalc"
brew "arp-scan"
brew "telnet"
brew "autossh"
brew "mosh"
brew "parallel"

# =============================================================================
# MONITORING & SYSTEM
# =============================================================================
brew "htop"
brew "btop"
brew "ctop"
brew "glances"
brew "asitop"
brew "fastfetch"
brew "fswatch"
brew "watch"
brew "tmux"
brew "screen"
brew "byobu"
brew "expect"
brew "starship"

# =============================================================================
# TERMINAL HELPERS
# =============================================================================
brew "tealdeer"
brew "howdoi"
brew "thefuck"
brew "translate-shell"
brew "grc"

# =============================================================================
# FILE PROCESSORS (JSON, CSV, etc.)
# =============================================================================
brew "exiftool"
brew "jq"
brew "yq"
brew "dasel"
brew "miller"
brew "xsv"
brew "qsv"

# =============================================================================
# MEDIA PROCESSING
# =============================================================================
brew "ffmpeg"
brew "mpv"
brew "mplayer"
brew "imagemagick"
# DESINSTALAR: ImageMagick fork redundante
# brew "graphicsmagick"
brew "webp"
brew "gifski"
# DESINSTALAR: Arr suite, legendas automáticas
# brew "bazarr"
# DESINSTALAR: Music server, uso baixo
# brew "navidrome"

# =============================================================================
# CLOUD & DEPLOY
# =============================================================================
brew "awscli"
# DESINSTALAR: CLI Heroku, 400MB+ pesado, uso raro
# brew "heroku"
# DESINSTALAR: CLI Fly.io, 72MB+ pesado, uso esporádico
# brew "flyctl"
# DESINSTALAR: CLI Vercel, 150MB+ pesado, uso esporádico
# brew "vercel-cli"
brew "netlify-cli"
brew "rclone"

# =============================================================================
# SECURITY TOOLS
# =============================================================================
brew "gnupg"
brew "pinentry-mac"
brew "pass"
brew "gopass"
brew "gnutls"
# DESINSTALAR: Ferramenta de pentest/CTF, uso nicho
# brew "hashcat"
brew "john"
brew "hydra"
# DESINSTALAR: Ferramenta de pentest, uso nicho
# brew "bettercap"
brew "sslsplit"
brew "fcrackzip"
brew "binwalk"
brew "md5deep"
brew "chkrootkit"
brew "spoof-mac"
brew "nikto"
brew "ncdu"

# =============================================================================
# IRC & EMAIL
# =============================================================================
brew "irssi"
brew "bitlbee"
brew "neomutt"
brew "isync"
brew "msmtp"
brew "notmuch"
brew "urlscan"
brew "urlview"

# =============================================================================
# WINDOW MANAGEMENT & macOS SPECIFIC
# =============================================================================
brew "duti"
brew "mas"
brew "wifi-password"
brew "tidy-html5"
brew "reattach-to-user-namespace"

# =============================================================================
# MISC UTILITIES
# =============================================================================
brew "pwgen"
brew "gpatch"
brew "m4"
brew "meson"
brew "nginx"
brew "unbound"
brew "dhcpdump"
brew "todo-txt"
brew "autojump"
brew "z"

# =============================================================================
# NETWORKING CASKS
# =============================================================================
cask "zerotier-one"

# =============================================================================
# DEVELOPMENT CASKS
# =============================================================================
cask "kitty"
cask "iterm2"
cask "github"
cask "visual-studio-code"
cask "sublime-text"
# cask "phpstorm"
# cask "webstorm"
# DESINSTALAR: Brave já é Chromium, redundante
# cask "google-chrome"
# DESINSTALAR: Navegador extra, Brave cobre bem
# cask "firefox"
cask "brave-browser"
cask "chromedriver"

# =============================================================================
# DOCKER (CLI-only, no Desktop)
# =============================================================================
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "colima"
cask "postman"
cask "ngrok"
cask "fork"

# =============================================================================
# PRODUCTIVITY CASKS
# =============================================================================
cask "obsidian"
# DESINSTALAR: Editor de longa escrita, uso ocasional
# cask "scrivener"
# DESINSTALAR: Time tracking automático, uso baixo
# cask "timing"
cask "hazel"
cask "maccy"
cask "maestral"
cask "netnewswire"
cask "numi"
cask "typora"
# DESINSTALAR: Editor Markdown redundante com Obsidian/Typora
# cask "zettlr"

# =============================================================================
# SECURITY CASKS
# =============================================================================
cask "bitwarden"
cask "arq"
cask "little-snitch"
cask "knockknock"
cask "onyx"
cask "oversight"

# =============================================================================
# UTILITIES CASKS
# =============================================================================
cask "keka"
cask "dupeguru"
cask "cyberduck"
# DESINSTALAR: GUI DB pesada, DBeaver cobre tudo
# cask "dbvisualizer"
cask "dbeaver-community"
cask "sequel-ace"
cask "postico"
# DESINSTALAR: MySQL GUI pesado, DBeaver cobre melhor
# cask "mysqlworkbench"
# DESINSTALAR: GUI SQLite, DBeaver cobre
# cask "db-browser-for-sqlite"
cask "sdformatter"
# DESINSTALAR: Gravação de ISO, uso raro
# cask "balenaetcher"
cask "unetbootin"
cask "transmission"
cask "vlc"
cask "iina"
cask "audio-hijack"
# DESINSTALAR: X11 server, raramente necessário no macOS moderno
# cask "xquartz"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "macfuse"
# DESINSTALAR: Software scanner Fujitsu, 1GB+ pesado
# cask "fujitsu-scansnap-home"
cask "superduper"
# DESINSTALAR: Extração de tabelas PDF, uso raro
# cask "tabula"
cask "utm"
cask "microsoft-remote-desktop"
cask "vnc-viewer"
cask "transmit"
# DESINSTALAR: Criptografia de nuvem, uso baixo
# cask "cryptomator"
# DESINSTALAR: GUI para pass, Bitwarden é mais prático
# cask "qtpass"
cask "macs-fan-control"
brew "mole"
cask "disk-inventory-x"
cask "diffmerge"
# DESINSTALAR: Diff GUI, uso raro
# cask "meld"
# DESINSTALAR: Snippet manager, uso baixo
# cask "lepton"
cask "carbon-copy-cloner"

# =============================================================================
# COMMUNICATION CASKS
# =============================================================================
cask "element"
cask "discord"
cask "telegram"
cask "signal"
cask "podcastmenu"

# =============================================================================
# MEDIA & ENTERTAINMENT CASKS
# =============================================================================
# DESINSTALAR: App de streaming pesado, usar web
# cask "tidal"
cask "ytmdesktop-youtube-music"
# DESINSTALAR: Player dedicado Jellyfin, uso ocasional
# cask "jellyfin-media-player"
# DESINSTALAR: Transcodificação de vídeo, uso raro
# cask "handbrake-app"
# DESINSTALAR: Rip de Blu-ray/DVD, uso esporádico
# cask "makemkv"
# DESINSTALAR: Usenet downloader, uso esporádico
# cask "sabnzbd"
# DESINSTALAR: Arr suite, automação de downloads
# cask "sonarr"
# DESINSTALAR: Arr suite, automação de downloads
# cask "radarr"
# DESINSTALAR: Arr suite, automação de downloads
# cask "lidarr"
# DESINSTALAR: Arr suite, indexer aggregator
# cask "prowlarr"
# DESINSTALAR: Media server, Jellyfin é open-source
# cask "embyserver"
# DESINSTALAR: Media server, uso ocasional
# cask "jellyfin"
# DESINSTALAR: Emulador multi-sistema, OpenEmu mais simples
# cask "retroarch"
cask "openemu"
# DESINSTALAR: Emulador GameCube/Wii, uso esporádico
# cask "dolphin"
# DESINSTALAR: Emulador PS2, uso esporádico
# cask "pcsx2"
# DESINSTALAR: Emulador Wii U, uso esporádico
# cask "cemu"
cask "steam"
cask "epic-games"
# DESINSTALAR: Launcher Blizzard, uso esporádico
# cask "battle-net"
# DESINSTALAR: Launcher EA, uso esporádico
# cask "ea"

# =============================================================================
# QUICKLOOK PLUGINS
# =============================================================================
cask "qlcolorcode"
# DESINSTALAR: QuickLook plugin, macOS já preview Markdown
# cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
# DESINSTALAR: QuickLook plugin, macOS já preview vídeo
# cask "quicklook-video"
cask "quicklook-csv"
cask "suspicious-package"
cask "webpquicklook"

# =============================================================================
# FONTS
# =============================================================================
cask "font-fontawesome"
cask "font-awesome-terminal-fonts"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
